// Типы почвы
export const SOIL_TYPES = {
    SANDY: 'песчаная', // Почва с высоким содержанием песка, хорошо дренирующая
    CLAY: 'глинистая', // Почва с высоким содержанием глины, удерживает воду
    SILTY: 'иловая', // Почва с высоким содержанием ила, плодородная и хорошо дренирующая
    LOAMY: 'суглинистая', // Почва, содержащая смесь песка, ила и глины, идеальная для растений
    PEATY: 'торфяная', // Почва с высоким содержанием органических материалов, кислая
    CHALKY: 'известковая', // Почва с высоким содержанием известняка, обычно щелочная
    ALKALINE: 'щелочная', // Щелочная почва
    ACIDIC: 'кислая', // Кислая почва
    FERTILE: 'плодородная', // Плодородная почва
    BROWN: 'бурозём', // Почва с коричневым цветом, типична для лесных и луговых зон
    RED: 'краснозём', // Почва с красным цветом, характерная для тропических и субтропических зон
    BLACK: 'чернозём', // Почва с черным цветом, богатая органическими веществами
    GREY: 'серозём', // Почва с серым цветом, типична для засушливых зон
    YELLOW: 'желтозём', // Почва с желтым цветом, характерна для тропических зон
    GREEN: 'зеленозём', // Почва с зеленым оттенком, редкий тип почвы
    BLUE: 'голубозём', // Почва с голубым оттенком, редкий тип почвы
    VIOLET: 'фиолетозём', // Почва с фиолетовым оттенком, редкий тип почвы
    MARCH: 'маршевые', // Почва, типичная для болотистых и заболоченных территорий
    SANDY_CLAY: 'песчано-глинистая', // Почва с комбинацией песка и глины
    SOLONCHAK: 'солончак', // Солевые почвы, типичные для засушливых регионов
    PEAT_MOSS: 'сапропель', // Почва, образованная из разлагающихся растительных остатков в водоемах
    FOREST_LITTER: 'лесная подстилка', // Органические остатки в лесных почвах
    GRASSLAND: 'луговые', // Почва, типичная для лугов и прерий
    MARSH: 'болотистые', // Почва, типичная для болотистых территорий
};
