keynumber, keyword = '', ''



"""
разкладка для linux
разкладка для android
перевести именем файлов в юникод

а
аз
лари
аг
ага
Аш
актив
ама
аи
ал
ало
алэ
аллах
анна
ат
аст
ауа
ап
алълъа
ай
аси овоси
ас @

буки
бысть

вэде
ижице ведева
вы
вэт
вицы
вини
вода
вьсы
вита

го
гол
гъа
га
глаголь
гл
гари
граФ
параграф 
герьвь
гэр

добро
даж
дза
дас
оспода

есть
естье
еръг
еръб
ерь
еры
еръ

иже краткая

ять
эхе
эк
эсть
эсо
эсть

ётъ
ёк
йо
есмь
ёю

живите
жд

зет
земля
зга
зжа
зело

моси
и двудесятичное
и двудесятичное кратка
и ижейное
иже
ио
иа
ису
исот
исто
иск
исп
ист
исм
иг
иже 
ижица ижейная
ирри

ыл
и десятичное
ым
эроый
ы
имми
ыдж

крест
кси
како
коло
кёу
ксъ
ка

люди
лот
ли
лёу
Лель
лаг
лъа
лы
лу

ма
мёу
миу
мы
Мью 
мол
ми
мо

нашь
нёу
ны
ный
шаныаш

ож
он
от
ор
ои
оп
омо
осьтэро
осът
ось
ой
осъм
осък
осъп
осъл
отси
ороси
ол
омеж

покой
п краткое
пи
па
по
пэр
посолонь
пост
пъл

ра
ро
рекуче
раг
ри
рикё

свастика
сымвол
слово
стым
сть
свиу
сигма
сэр
сы
суль
свим


талева
тои
той
твердо
тау
тэро
тэр
тор

уст
усп
ук
ут
уы
уста

ют
юс
юни
юн

я
слово
ятый

хэр
хв
хоро

ферть
фита

ща

ша

червь

возьми и от говорова отобрав 34 буковы
в 2 слоя 60

гаяметрии фигуры лучевики обозначения
препинатели ?!,.\_~° апостроф 
операторы счёта +-%:*/(){}<>[]=#№&÷
цифири 11 в 0 12 в 0
счёт пунктуация бѣговы очерк (пусто залито) цвѣт звук вкус запах


без
ище
ви v
ео
ка ₳
ос  ⊰ 
ис  
го ∢
ле ₪

кр хр гр
пл
ст
грд
мр

ило 0
один 1
сква 4
даж 3
дв 2
пан 5
сест 6
сѣм 7
веос ∞
дэв 9
дэст ѳ
11 ӫ 
12 U+218A

га ғ
си ₵
со ⊱
ди ∐
из √
кх
коло ⊙
окружность 
Circled: ⊕⊖⊗⊘⊙⊚⊛⊜⊝
круг ◯
ск скварог скварта
ерц
эе
ҟҥӹҸѻӵ  ӥұ үҩ ѷ҂  ҁϡͳΛΐљњϼϞʡʢɴɳɷɘɢ∞


ↂↁↀↄ
⊿△◊ ▱□▯◇⏢⬭
ᛟᚴᚠᛃᚸᛯᛤᛢᛥᛪ
∠⟂⊾

радиус ⓟ
ⓓ
хорда

площадь ⓦ
периметр ⓥ
вдоль
ввысь
вшырь

ин
он
ок
ук
ич
арь
ман
ал
тео
тика
дар
хв
ать
ков
ван
ион 
дасть
бить
град
скоп
поли
ер
многоугольник ⬠
.. вписан описан
лучевик ☆
точка т.
центр ц.
отрезок
прямая
луч
медиана
бисектриса
таблица
тангентус
сатус
объём
сфира плужность сферы
сакус

8 ∞
7 с перекладиной
69 с углами
ище
ви v
та
ща
кх
ди ∐
10
11
ск скварог скварта
ерц
кх
коло ⊙
окружность 
тео
три
радиус ⓟ
диаметрⓓ
плужность ⓦ
периметр ⓥ
многоугольник н⬠
длугость слева на право
высость снизу вверх
шырость слева на право под 45
лучевик н☆
хэ ʃ
круг ◯
иа ꙗ
ие ѣ
ка ࿖
кс ѯ
ку q
ла £
пе
ли ʟ
ве β
га ґ
го ÷
гх h
да d
за
де ‽
ди ¿
ду §
жи g
аг ∀
без ~
ме
ае æ
ак ʞ
ар ʀ
ас @
ба b
би ¦
ми m
мо ϟ
на n
ово θ
тор
ри
не ≠
ма ᛝ
но №
об %
оу ɣ
од ѭ
ое œ
ом ω
ор þ
ле ł
ко ₭
ло ö
ок ྿
ол ᚖ
он ∯
ро ø
та τ
от w
па ѧ
пи π
по ů
пс ѱ
ра ₽
ре ₱
са s
си ¢
со ℅
су ∾
ург ÿ
ус µ
ум λ
фа ₴
фи φ
ха ђ
хи ±
ца ʁ
ци џ
ча ⌗
чи ¥
три ߡ
ан ǂ
аз z
ал ä
ам ߍ
ос ©
ва &
ге ŧ
дж j
дз š
до ð
жа ӝ
зе ǝ
зо ɔ
из ¿
ин ŋ
ис v
ме ᗐ
ни !
пе #
ри ɨ
се €
то ⌘
ту f
ук ⋎
ун ೱ
хо 𐌈
чу ʎ
ша ψ

боговы цифры8-16 операторы силы гаяметрия символы лучевики многонраники формы

"""


import os

# ?&|!{}[]()^~*:\`"'+-;<>%=_#$.,/

знаки_замђны = """
ие ѣ
гх h
ас @
от w
""".lower().strip().splitlines()


def do912916(value):
    index_keyword, index_keynumber, result = 0, 0, ''
    for i, chr in enumerate(value):
        if chr.isdigit():
            if index_keynumber > len(keynumber) - 1:
                index_keynumber = 0
            chr = '{0:02}'.format(int(chr) + int(keynumber[index_keynumber]))
            index_keynumber += 1
        elif chr.isalpha():
            if index_keyword > len(keyword)-1:
                index_keyword = 0
            chr = chr + keyword[index_keyword]
            index_keyword += 1
        result += chr
    return result


def zaclaboinavolu(value):
    index_value, index_keyword, index_keynumber, result = 0, 0, 0, ''
    while index_value < len(value):
        if value[index_value].isdigit():
            if index_keynumber > len(keynumber) - 1:
                index_keynumber = 0
            result += str(int(value[index_value: index_value+2]) - int(keynumber[index_keynumber]))
            index_keynumber += 1
            index_value += 2
        elif value[index_value].isalpha():
            if index_keyword > len(keyword)-1:
                index_keyword = 0
            result += (value[index_value: index_value+2]).replace(keyword[index_keyword], '', 1)
            index_keyword += 1
            index_value += 2
        else:
            result += value[index_value]
            index_value += 1
    return result





def тайнопись_файлъ(имя_файла_в_входной_папке, затаїть, путь_входной_папке="../", путь_исходной_папки='../_temp/'):
    if not os.path.exists(путь_исходной_папки):
        os.makedirs(путь_исходной_папки)
    файл_новый_путь = путь_исходной_папки + имя_файла_в_входной_папке
    файл_новый = open(файл_новый_путь, 'w')
    print(файл_новый_путь)
    with open(путь_входной_папке + имя_файла_в_входной_папке, 'r') as файл_старый:
        for line in файл_старый.readlines():
            line = line.lower()
            for знаки in знаки_замђны:
                if затаїть:
                    line = line.replace(знаки.split()[0], знаки.split()[1])
                else:
                    line = line.replace(знаки.split()[1], знаки.split()[0])
            файл_новый.write(line)
    файл_новый.close()


def затаїть_файлъ(имя_файла_в_входной_папке, путь_входной_папке="../", путь_исходной_папки='../_temp/'):
    тайнопись_файлъ(имя_файла_в_входной_папке, True, путь_входной_папке, путь_исходной_папки)


def wтаїть_файлъ(имя_файла_в_входной_папке, путь_входной_папке="../", путь_исходной_папки='../_temp/'):
    тайнопись_файлъ(имя_файла_в_входной_папке, False, путь_входной_папке, путь_исходной_папки)


# затаїть_файлъ('мы велокастръ.txt')
# затаїть_файлъ('_.txt')
# wтаїть_файлъ('мы велокастръ.txt')
# wтаїть_файлъ('_.txt')
