import React from 'react';

import РасчётъМощность from './РасчётъМощность';
import РасчётъНагрузки from './РасчётъНагрузки';
import РасчетъСеченияПроводов from './РасчетъСеченияПроводов';
import РасчетъТемпературыКабелей from './РасчетъТемпературыКабелей';
import РасчетъСопротивленияКабелей from './РасчетъСопротивленияКабелей';
import РасчетъСопротивленийИмпеданс from './РасчетъСопротивленийИмпеданс';
import РасчетъПотерьНапряжения from './РасчетъПотерьНапряжения';
import РасчетъЭнергоэффективности from './РасчетъЭнергоэффективности';
import РасчетъПотребленияЭнергии from './РасчетъПотребленияЭнергии';
import РасчетъДвигателя from './РасчетъДвигателя';

const Calculations = () => {

    return (
        <div>
            <h3>Расчеты</h3>

            <div>
				<РасчетъДвигателя />

				<РасчетъЭнергоэффективности />
				<РасчетъПотребленияЭнергии />
				<РасчетъПотерьНапряжения />
				<РасчетъСопротивленийИмпеданс />
				<РасчетъСопротивленияКабелей />
				<РасчетъТемпературыКабелей />
				<РасчетъСеченияПроводов />
				<РасчётъНагрузки />
				<РасчётъМощность />
            </div>
        </div>
    );
};

export default Calculations;
