
import React from 'react'

export default function Кружево() {
  return (
    <div>Кружево</div>
  )
}



// плетёное:
//     на коклюшках, подразделяется на:
//         численное — по числу переплетений, узоры геометрические, подготовительного рисунка не требуется;
//         парное — узор и фон плетутся одновременно, выполняется по подготовительному рисунку (сколку);
//         сцепное — сначала плетется узорная тесьма, которая затем соединяется крючком в разные фигуры (преимущественно растительный орнамент), выполняется по сколку
// шитое:
//     игольное
//     хардангер
// узелковое:
//     макраме
//     фриволите (плетёное челноком)
// вязаное:
//     на спицах
//     крючком
// 		короткий крючок
// 			обычное (немецкое)
// 			филейное
// 			брюггское
// 			ирландское
// 			гипюр
// 			ретичелла
// 			на вилке
// 			на бумаге и стекле
// 		длинный крючок
// 			тунисское
// 			афганское
// 			викторианское


// шетландское
// вологодское

// const  = [
//   {
//     name: 'Ирландское кружево',
//     description: 'Сложная техника вязания, использующая элементы кружевных узоров для создания красивых и детализированных изделий.',
//     advantages: 'Высокая декоративность, сложные узоры.',
//     disadvantages: 'Может быть трудоемким, требует большого количества времени.',
//     application: 'Свадебные платья, декоративные элементы, салфетки.',
//     materialAvailability: 'Специальные материалы',
//     needlesHooks: 'Спицы и крючок',
//     stitchesUsed: 'Кружевные петли, ракушки',
//     construction: 'Отдельными частями',
//     yarnsUsed: 'Тонкие пряжи',
//     finishing: 'Видимые швы',
//     difficulty: 'Высокая',
//   },
// ]

