import React from 'react';

import РасчётъМощность from '../Электронъ/Расчёты/РасчётъМощность';
import РасчётъНагрузки from '../Электронъ/Расчёты/РасчётъНагрузки';
import РасчетъСеченияПроводов from '../Электронъ/Расчёты/РасчетъСеченияПроводов';
import РасчетъТемпературыКабелей from '../Электронъ/Расчёты/РасчетъТемпературыКабелей';
import РасчетъСопротивленияКабелей from '../Электронъ/Расчёты/РасчетъСопротивленияКабелей';
import РасчетъСопротивленийИмпеданс from '../Электронъ/Расчёты/РасчетъСопротивленийИмпеданс';
import РасчетъПотерьНапряжения from '../Электронъ/Расчёты/РасчетъПотерьНапряжения';
import РасчетъЭнергоэффективности from '../Электронъ/Расчёты/РасчетъЭнергоэффективности';
import РасчетъПотребленияЭнергии from '../Электронъ/Расчёты/РасчетъПотребленияЭнергии';
import РасчетъДвигателя from '../Электронъ/Расчёты/РасчетъДвигателя';

const Calculations = () => {

    return (
        <div>
            <h3>Расчеты</h3>

            <div>
				<РасчетъДвигателя />

				<РасчетъЭнергоэффективности />
				<РасчетъПотребленияЭнергии />
				<РасчетъПотерьНапряжения />
				<РасчетъСопротивленийИмпеданс />
				<РасчетъСопротивленияКабелей />
				<РасчетъТемпературыКабелей />
				<РасчетъСеченияПроводов />
				<РасчётъНагрузки />
				<РасчётъМощность />
            </div>
        </div>
    );
};

export default Calculations;
